
## Plan Result (aat)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.fee_pay_team_telephony_subscription
  * azurerm_api_management_subscription.pcipal_supplier_subscription
  * azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key
  * azurerm_key_vault_secret.pcipal_supplier_subscription_key
  * module.cft_api_mgmt_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_product.azurerm_api_management_product.product
  * module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_telephony_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_telephony_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Telephony API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.pcipal_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "pcipal_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Telephony API - PCIPal Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_bulk_scan_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "fee-pay-team-telephony-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.pcipal_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "pcipal_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "pcipal-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "Telephony API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "telephony-api"
      + path                  = "telephony-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://payment-api-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/ccpay-payment-app.telephony.json"
        }
    }

  # module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "telephony-api"
      + id                  = (known after apply)
      + product_id          = "telephony"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "telephony-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;68EDF481C5394D65962E9810913455D3EC635FA5&quot;,&quot;13D1848E8B050CE55E4D41A35A60FF4A17E686A6&quot;,&quot;C46826BF1E82DF37664F7A3678E6498D056DA4A9&quot;,&quot;B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="403" reason="Invalid client certificate."/>
                            </return-response>
                        </when>
                    </choose>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="api_gw" />
                    <set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = &quot;ABCDEFGHIJKLMNOPQRSTUVWXYZ234567&quot;;
                            var bits = &quot;C5OI566EGMPHT3CC&quot;.ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] &amp; 0xf;
                            int truncatedHash = hash[offset] &amp; 0x7f;
                            for (int i = 1; i &lt; 4; i++)
                            {
                                truncatedHash &lt;&lt;= 8;
                                truncatedHash |= hash[offset + i] &amp; 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString(&quot;D6&quot;);
                        }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "telephony"
      + id                    = (known after apply)
      + product_id            = "telephony"
      + published             = true
      + resource_group_name   = "cft-aat-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-stg"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "telephony"
      + resource_group_name = "cft-aat-network-rg"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1671,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->